Revit 2027 API
Application.GetAssets Method
 Gets all the Assets of the specified type.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Asset> GetAssets(
	AssetType assetType
)
Public Function GetAssets (
	assetType As AssetType
) As IList(Of Asset)
public:
IList<Asset^>^ GetAssets(
	AssetType assetType
)
member GetAssets :
        assetType : AssetType -> IList<Asset>
Parameters
assetType AssetType
 The asset type.
Return Value
IList<Asset>
 Returns an array of all the Assets within Revit of the specified type.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace